package Day16;

public class Demo5 {

	public static void main(String[] args) {
		//int[] arr=new int[]{1,25,2,3,21,48,9,6,7,8,9,10,12};
		//                    0  1 2 3 4 5 6 7 8 9 10 11 12 13
		//一维数组
		//二维
		//多维
		//定义
		int[][] arr=new int[5][];
		//[]语数外
		//50,60,70  1
		//50,60,70  2
		//23,15,14  3
		int[][] arr1={{50,60,70},{50,155,60,70},{23,15,14}};
		/**
		 * [ [50,60,70],[150,160,170],[223,215,214] ]
		 *      0            1             2
		 * 一维数组有3个元素,分为是:[50,60,70].[150,160,170].[223,215,214]..
		 * 二维数组有3个元素,分为是:
		 */
		System.out.println(arr1[2][2]);
		//请打印所有元素
		
		
		
		
	}
}
